tutorials-pM4F/darcyFoam/phreeqcRM/calciteDissolutionGypsumPrecipitationPorosityClogging/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidProperties
{
	densityModel constantDensity;

	constantDensityCoeffs
	{
		rho0         rho0   [ 1 -3 0 0 0 0 0 ] 1000;
	}

	viscosityModel constantViscosity;

	constantViscosityCoeffs
	{
		nu0         nu0   [ 0 2 -1 0 0 0 0 ] 1e-6;
	}

}


transportModel  Newtonian;
mu 		mu [1 -1 -1 0 0 0 0] 1e-3;


geochemicalModel phreeqcRM;

geochemicalProperties
{

 mineral (Calcite Gypsum);

 absolutePermeabilityModel KozenyCarman;
 KozenyCarmanCoeffs
 {
	updateFromInitialValue true;
	K0 K0 [0 2 0 0 0 0 0] 1.18602e-11;
 }

 dispersionModel none;

 CalciteProperties
 {
	activatePhaseEquilibrium false;
	rhos rhos [1 -3 0 0 0 0 0] 2707;
	Vm Vm [0 3 0 0 -1 0 0] 36.93336e-6;
	surfaceAreaModel mingliangLaw;
	mingliangLawCoeffs
	{
	 A0 A0 [0 -1 0 0 0 0 0] 0.1;
	 n 0.667;
	 initVF 0.3;
	}
 }

 GypsumProperties
 {
        activatePhaseEquilibrium false;
        rhos rhos [1 -3 0 0 0 0 0] 2320;
        Vm Vm [0 3 0 0 -1 0 0] 74.21216e-6;
        surfaceAreaModel mingliangLaw;
        mingliangLawCoeffs
        {
         A0 A0 [0 -1 0 0 0 0 0] 0.1;
         n 1.;
         initVF 0.;
        }
 }

 phreeqcRM
 {
        PhreeqcInputFile "phreeqcInput"; 
        PhreeqcDataBase  "phreeqc.dat";
        activateUpdatePorosity true;
	StrangSteps 6;
 }

}

// ************************************************************************* //
