tutorials-pM4F/darcyFoam/phreeqcRM/calciteDissolutionGypsumPrecipitationPorosityClogging/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType laminar;

/*
laminar
{
    laminarModel        Stokes; //Maxwell;

    MaxwellCoeffs
    {
        nuM             1;
        lambda          5;
    }

    printCoeffs         on;
}
*/

// ************************************************************************* //
